<!DOCTYPE html>
<html lang="en">
  <head>
    <link rel="stylesheet" type="text/css" href="assets/style.css">
    <link href="https://fonts.googleapis.com/css?family=Montserrat:400,700" rel="stylesheet">
    <script src="https://cdnjs.cloudflare.com/ajax/libs/smooth-scroll/11.1.0/js/smooth-scroll.min.js"></script>
    <script src="assets/index.js"></script>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Desafio Profiossional</title>
  </head>
  <body>
    <div class="wrapper">
      <aside class="main-navbar">
        <div class="inner">
          <header>
            <h1 class="logo-navbar">DESAFIO<span>PROFISSIONAL</span></h1>
          </header>
          <div id="menu-sections-wrapper">
            <section class="main-menu">
              <header class="menu-section-title">
                <h2>Menu</h2>
              </header>
              <nav>
                <ul>
                  <li><a data-scroll="data-scroll" href="index.html">Home</a></li>
                  <li><a data-scroll="data-scroll" href="sistemas_web.html">Ferramentas para Sistema Web</a></li>
                  <li><a data-scroll="data-scroll" href="sistemas_operacionais.html">Sistemas Operacionais</a></li>
                  <li><a data-scroll="data-scroll" href="org_de_comp.html">Organização de Computadores</a></li>
                  <li><a data-scroll="data-scroll" href="dpp.html">DPP</a></li>
                  <li><a data-scroll="data-scroll" href="prob_e_estatistica.html">Probabilidade e Estatistica</a></li>
                </ul>
              </nav>
            </section>
            <section>
              <header class="menu-section-title">
                <h2>Tópicos</h2>
              </header>
              <nav>
                <ul>
                  <li><a data-scroll="data-scroll" href="#evolucao">Evolução da internet</a></li>
                  <li><a data-scroll="data-scroll" href="#a-web">A Web</a></li>
                  <li><a data-scroll="data-scroll" href="#html">HTML</a></li>
                  <li><a data-scroll="data-scroll" href="#url">URL</a></li>
                  <li><a data-scroll="data-scroll" href="#paginas">Arquivos de página Web</a></li>
                  <li><a data-scroll="data-scroll" href="#css">A Estrutura Básica do CSS3</a></li>
                </ul>
              </nav>
            </section>
          </div>
        </div>
      </aside>
      <main class="main">
        <section id="introducao">
          <div class="container">
            <header>
              <h1 class="title">Ferramentas para Sistema Web</h1>
            </header>
          </div>
        </section>
        <article class="main-article">
          <div class="container">
            <section id="evolucao">
              <h2 class="title">Evolução da internet</h2>
              <p>A Internet é uma rede das redes que movimenta as informações do mundo todo e nos dá acesso a toda hora. Teve início em 1969. A história nos descreve que na década de 1960 ainda não havia redes e tínhamos apenas computadores sem ligação uns com os outros, que trabalhavam isoladamente. Depois de muitas pesquisas surgiu a ideia de conectarem computadores para compartilharem dados. De acordo com Mileto, a Internet foi criada por Tim Berners-Lee quando ele realizava pesquisas para interligar e compartilhar documentos entre os pesquisadores. Foi somente em 1969 que a ARPA (Advanced Research Projects Agency) do departamento de defesa dos Estados Unidos apresentou a ARPANET, que consistia em uma pequena rede de computadores conectados.</p>
            </section>
            <section id="a-web">
              <h2 class="title">A Web</h2>
              <p>World Wide Web – ou WWW – que se trata de um sistema de documentos em hipermídias que são interligadas e executadas na internet. A World Wide Web pode transformar milhões de documentos para que possam ser acessados pela Internet, mas esses documentos são escritos, de alguma forma, utilizando o HTML   (HyperText Markup Language).</p>
            </section>
            <section id="html">
              <h2 class="title">HTML</h2>
              <p>O HTML é a abreviação de (HyperText Markup Language) que quer dizer linguagem de marcação de hipertexto, ou seja, é a linguagem em que são escritas as páginas da web que são utilizadas e, na maioria das vezes, é facilmente interpretada pelo navegador. Esta linguagem apresenta duas características: o hipertexto e a universalidade. O hipertexto são as informações ligadas na forma de páginas com interconexões entre elas - os links, em que a informação na web pode ser acessada em direções diferentes. Os documentos em HTML são salvos como arquivos de texto de modo que qualquer computador possa ler a página, não importando seu sistema operacional, ou seja, a web é aberta para todos, o que causa a universalidade. O HTML  fornece inúmeros recursos, com vários elementos, para detalhes, às vezes pequenos e bem específicos, para textos. A versão mais atual da especificação da linguagem HTML é a 5.</p>
            </section>
            <section id="url">
              <h2 class="title">URL</h2>
              <p>A URL (Uniform Resouce Locator),que contém informações sobre onde o arquivo está e sua funcionadidade, ou seja, o que o navegador pode fazer com este arquivo. Cada arquivo na Internet tem uma única URL. A URL é divididas em partes, sendo a primeira  esquema, que informa como lidar com o arquivo que será aberta.Este, na maioria das vezes, é seguido de dois pontos  e duas barras diagonais.Um exemplo de esquema comum é o HTML, o protocolo de transferência de hipertexto, utilizado para acessar paginas Web. A próxima parte é o nome do servidor onde o arquivo está localizado, e também o caminho que leva ao arquivo.</p>
            </section>
            <section id="paginas">
              <h2 class="title">Arquivos de página Web</h2>
              <p>Para montarmos uma pagina primeiramente utilizaremos um editor de texto e como referência é indicado o Bloco de notas. O arquivo deve ser salvo como index.html, que é o nome para designar a pagina, como pagina padrão a ser aberta na pasta em que se encontra. Este nome é reconhecido pela maioria dos servidores web como pagina padrão em cada pasta. A pagina padrão (index.html) que é criada no topo do diretório web, ou raiz, é a homepage. Basicamente, um documento HTML é composto por elementos hierarquicamente organizados. Para inserir um elemento em um documento HTML, devemos utilizar as tags correspondentes a esse elemento.</p>
              <p>
                <ul>
                  <li><strong>As tags</strong> - comando  específicos colocados entre os sinais < e >, sempre aparecem em pares (inicio e fim).</li>
                  <li><strong>Os atributos</strong> - são formados por nome e valor. Normalmente, os valores dos atributos são definidos  dentro de aspas dupla e o conteúdo dos elementos é um texto ou outros elementos.</li>
                </ul>
              </p>
              <p>Estrutura B&aacute;sica da Linguagem HTML &lt;!DOCTYPE html&gt; Declara&ccedil;&atilde;o do tipo de documento &lt;html lang=&#x201d;pt-br&#x201d;&gt; Tag de abertura do elemento HTML &#x2013; marca inicio e fim da p&aacute;gina &#x2013; determina que est&aacute; escrito em html &lt;head&gt; marca inicio e fim do cabe&ccedil;alho &#x2013; descri&ccedil;&atilde;o dos cabe&ccedil;alhos e t&iacute;tulos (aba da pagina do browser) &lt;title&gt;K19 Treinamentos&lt;/title&gt; marca inicio e fim do titulo da pagina &lt;/head&gt; &lt;body&gt; marca inicio e fim do corpo da pagina (contem texto, imagem, link) &lt;p&gt; &lt;P&gt; respons&aacute;vel pela quebra de par&aacute;grafo &lt;/body&gt;&lt;/html&gt; Tag de fechamento do elemento HTML Temos aqui outros c&oacute;digos para incrementar a pagina, deixando-as mais bonitas. &lt;Center&gt; coloca o texto alinhado ao centro &lt;B&gt; negrito &lt;I&gt; it&aacute;lico &lt;U&gt; sublinhado &lt;PRE&gt; deixa o texto da maneira em que foi digitado &lt;P&gt; quebra de par&aacute;grafo &lt;P align = &#x201c;Left&#x201d;&gt; alinha o texto conforme especificado &lt;FONT size = &#x201c;n&#x201d; face = &#x201c;nome da fonte&#x201d; color = &#x201c;cor&#x201d;&gt; &lt;BR&gt; quebra de linha sem acrescentar espa&ccedil;os extras &lt;HR width = &#x201c;n&#x201d; align = &#x201c;posi&ccedil;&atilde;o&#x201d; size = &#x201c;n&#x201d; color = &#x201c;cor&#x201d; noshade&gt; ultimo &eacute; linha sem sombra. &#x2022; O &lt;hgroup&gt; &Eacute; o elemento que &eacute; poss&iacute;vel agrupar cabe&ccedil;alhos, pois eles podem ter diversos n&iacute;veis consecutivos. &#x2022; O &lt;p&gt; &Eacute; o elemento para iniciar um paragrafo. &#x2022; O &lt;Address&gt; define a informa&ccedil;&atilde;o de contato para as pessoas em uma pagina. Utilizado para fornecer informa&ccedil;&otilde;es de contato dos autores ou donos do documento. Normalmente, esse elemento aparece no in&iacute;cio ou no final das p&aacute;ginas. (linha com nome e contato) &#x2022; &lt;h1&gt; &lt;/h1&gt; hierarquia de t&iacute;tulos para estabelecer uma divis&atilde;o do seu conte&uacute;do. Devemos utilizar os elementos h1, h2, h3, h4, h5 e h6. &#x2022; Datetime &eacute; o atributo do tempo que utilizamos o elemento time . &#x2022; &lt;cite&gt; cita&ccedil;&atilde;o ou referencia &eacute; atrav&eacute;s do elemento. Imagens na Web Primeiramente, &eacute; importante saber sobre o formato, pois a imagem vai ser salva e deve ser acessada sem problemas, n&atilde;o importando os Sistemas Operacionais. Atualmente os formatos mais utilizados na web s&atilde;o: GIF, PNG e JPEG. A inser&ccedil;&atilde;o de figuras &eacute; digitar &lt;figcaption&gt; na sequencia, digite o texto da legenda adicionando o c&oacute;digo para imagens, v&iacute;deos. &lt;body Background= &#x201c;fundo.gif&#x201d;&gt; coloca uma figura de fundo no site &lt;IMG SRC = &#x201c;nome do arquivo&#x201d; align = &#x201c;posi&ccedil;&atilde;o&#x201d;&gt; Links para a Web Al&eacute;m de interessante, uma pr&aacute;tica satisfat&oacute;ria, que d&aacute; vida a web, &eacute; a utiliza&ccedil;&atilde;o dos links, que permitem conectar uma p&aacute;gina a outra, sem ser necess&aacute;rio usar somente uma p&aacute;gina. Para entender sobre os links, primeiramente &eacute; preciso saber como estes s&atilde;o divididos, j&aacute; que possuem duas partes principais: um destino e um rotulo. O destino &eacute; a parte mais importante, que especifica o que ocorre quando o link &eacute; acionado. O rotulo, a segunda parte do link, &eacute; a parte que o visitante v&ecirc; no navegador ou ouve em um leitor de telas e que &eacute; utilizada para ativar o alcance do destino, que pode ser um texto, uma imagem ou ambos. &lt;a href=&#x201d;page.html&#x201d;&gt;. Incluir links: s&oacute; precisa especificar o nome do arquivo. &lt;A HREF = &#x201c;nome do arquivo.extens&atilde;o&#x201d; &gt; texto que servira de link.</p>
            </section>
            <section id="css">
              <h2 class="title">A Estrutura Básica do CSS3</h2>
              <p>CSS &eacute; a mesma coisa que Style Sheets e que Folhas de Estilo. &Eacute; mais uma forma de aperfei&ccedil;oar seus documentos. Economizar o seu tempo. Diminuir o tamanho do c&oacute;digo de sua p&aacute;gina. <br/>Sua p&aacute;gina ir&aacute; carregar mais rapidamente. Mais facilidade de manter e fazer altera&ccedil;&otilde;es na p&aacute;gina. Mais controle no layout da p&aacute;gina. A folha de estilo &eacute; um arquivo de texto que cont&eacute;m regras para determinar como os elementos em sua p&aacute;gina devem ser exibidos. Essas regras podem ser propriedades ou valores que controlam a formata&ccedil;&atilde;o b&aacute;sica, tais como tamanho da fonte, cor, propriedades de layout, posicionamento, flutua&ccedil;&atilde;o, controle de impress&atilde;o, quebras de paginas, surgimento e desaparecimento de componentes interativos. O CSS pode ser criado fora de uma p&aacute;gina, na web, para ser aplicado em todas as paginas do site de uma vez s&oacute;. Dentre suas, vantagens, est&atilde;o e aa flexibilidade e a efici&ecirc;ncia, que permitem economia de tempo e de banda de conex&atilde;o. <br/>Como criar estilos <br/>&#x2022;	Cada estilo que &eacute; criado &eacute; definido como uma regra CSS. <br/>&#x2022;	Cada regra deve utilizar a seguinte sintaxe: elemento {atributo1: valor; atributo2: valor ...} <br/>Onde: <br/>&#x2022;	Elemento - descreve o elemento de design ao qual o estilo ser&aacute; aplicado. A mesma tag HTML mas, sem os sinais de maior e menor. Essa parte da regra &eacute; &agrave;s vezes chamada de seletor.<br/>&#x2022;	Atributo - o aspecto espec&iacute;fico do elemento que voc&ecirc; quer usar como estilo. Deve ser um nome de atributo CSS v&aacute;lido, como o atributo font-size. <br/>&#x2022;	Valor - a configura&ccedil;&atilde;o aplicada ao atributo. Deve ser uma configura&ccedil;&atilde;o v&aacute;lida para o atributo em quest&atilde;o, como 20pt (20 pontos) para font-size.<br/>Exemplo:<br/>Eis uma regra CSS que especifica que todos os t&iacute;tulos de n&iacute;vel 1 (tags &lt;H1&gt;) sejam exibidos em uma fonte de 36 pontos: H1 {font-size: 36pt} <br/>Aqui est&aacute; um exemplo de regra que diz que todos os t&iacute;tulos de n&iacute;vel 2 (tags &lt;H2&gt;) devem ter tamanho de 24 pontos e cor azul; H2 {font-size: 24pt; color: blue} Pode-se inserir quebras de linha e espa&ccedil;os em branco dentro da regra como quiser. Assim, &eacute; poss&iacute;vel ver mais facilmente todas as declara&ccedil;&otilde;es e certificar-se de que colocou todos os sinais de ponto-e-v&iacute;rgula e colchetes nos lugares corretos. As chaves {} delimitam o bloco de declara&ccedil;&atilde;o. <br/><br/>Folhas de Estilo<br/>O CSS permite aplicar as folhas de estilo de um arquivo a varias paginas, pode ser a todo o site, a uma s&oacute; pagina ou a algum elemento HML individual. &lt;link rel=&#x201d;stlesheet&#x201d;&gt;.<br/>Com o CSS &eacute; poss&iacute;vel formatar o texto com estilos, ou seja, pode-se modificar sua fonte, seu tamanho, sua inclina&ccedil;&atilde;o, sua altura da linha e suas cores tanto de primeiro como do segundo plano, al&eacute;m do espa&ccedil;amento e do alinhamento. Estas  altera&ccedil;&otilde;es pode ser aplicadas a um documento ou site com algumas linhas de c&oacute;digo.<br/>Os Seletores<br/>Os seletores determinam em quais elementos uma regra de estilos, ou seja, a formata&ccedil;&atilde;o ser&aacute; aplicada, diferenciando-se das declara&ccedil;&otilde;es, que apenas o formato a ser aplicado. Um seletor pode definir at&eacute; cinco crit&eacute;rios diferentes para escolher os elementos de devem serem formatados.<br/>Podem-se definir regras de CSS em tr&ecirc;s lugares:<br/>E, por defini&ccedil;&atilde;o, pode utilizar uma combina&ccedil;&atilde;o dos tr&ecirc;s m&eacute;todos nos suas webs sites. A maneira como as regras interagem entre si est&aacute; relacionada &agrave; parte &quot;em cascata&quot;.<br/>&#x2022;	Em um documento separado fora de todos os documentos HTML; <br/>&#x2022;	No cabe&ccedil;alho de um documento HTML  <br/>&#x2022;	Dentro de uma tag de HTML. <br/>Cada um destes m&eacute;todos tem um nome e afeta as p&aacute;ginas HTML em seu site de um modo diferente, como discutido aqui: Externo significa que voc&ecirc; coloca as regras de CSS em um arquivo separado, e ent&atilde;o sua p&aacute;gina HTML pode fazer um link para esse arquivo. Essa abordagem lhe permite definir regras em um ou mais arquivos que podem ser aplicadas em alguma p&aacute;gina do seu web site.<br/>&#x2022;	Incorporado: Significa que voc&ecirc; especifica as regras de CSS no cabe&ccedil;alho do documento. As regras incorporadas afetam somente a p&aacute;gina atual.<br/>&#x2022;	Online: Significa que voc&ecirc; especifica as regras de CSS dentro da tag de HTML. Essas regras afetam somente a tag atual.<br/>&#x2022;	Estilos Externos :Para definir um conjunto de regras coloca as regras em um arquivo de texto. Voc&ecirc; pode criar este arquivo com um editor de textos simples, como o Notepad do Windows, e dar ao nome desse arquivo a extens&atilde;o .css.<br/>Sempre que quiser utilizar esses estilos em uma nova p&aacute;gina, basta colocar uma tag &lt;LINK&gt; no cabe&ccedil;alho que referencie esse arquivo .css. <br/><br/>Veja o exemplo: Arquivo &Oacute;rg&atilde;o Colegiado.css <br/><br/>H4 {  font-family: 'Arial';  font-size: 14pt;  color: blue } <br/><br/>Agora, para utilizar os estilos definidos neste arquivo .css voc&ecirc; precisa adicionar a tag a seguir ao cabe&ccedil;alho da p&aacute;gina, onde nome do arquivo &eacute; uma refer&ecirc;ncia absoluta ou relativa ao arquivo .css. <br/><br/>&lt;LINK REL=&quot;STYLESHEET&quot; HREF=&quot; OrgaoColegiado.css&quot; TYPE=&quot;text/css&quot;&gt;<br/><br/>&#x2022;	As tags&lt;HEAD&gt;...&lt;/HEAD&gt;utilizada para localiza&ccedil;&atilde;o correta do seu arquivo e seu nome.<br/><br/>A estrutura b&aacute;sica de uma p&aacute;gina da web que utiliza estilos incorporados &eacute; semelhante ao seguinte c&oacute;digo: <br/><br/>&lt;HTML&gt;<br/>   &lt;HEAD&gt;<br/>      &lt;TITLE&gt; Exemplo   Estilos  Incorporados &lt;/TITLE&gt;<br/>      &lt;STYLE TYPE=&quot;text/css&quot;&gt;&lt;!--<br/>         P {  background-color: #FFFFFF;<br/>              font-family:'Comic Sans MS';<br/>              font-size: 14p  }<br/>       --&gt;&lt;/STYLE&gt;<br/>   &lt;/HEAD&gt;<br/>   &lt;BODY&gt;<br/>      &lt;P&gt; teste de um arquivo para ver como fica esta historia<br/>   &lt;/BODY&gt;<br/>&lt;/HTML&gt;<br/></p>
            </section>
          </div>
        </article>
      </main>
    </div>
  </body>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/smooth-scroll/11.1.0/js/smooth-scroll.min.js"></script>
  <script src="assets/index.js"></script>
  <script>smoothScroll.init();</script>
</html>